
Функция ТочноеТекущееВремя() Экспорт 
	
	Script = Новый COMОбъект("MSScriptControl.ScriptControl");
	Script.Language = "javascript"; 
	Возврат Script.eval("new Date().getTime()")
	
КонецФункции

Функция СтрВхождения(Строка, ПодстрокаПоиска, ё = 0)
	
	Ответ = Новый Массив;
	
	Для ж = 1 По СтрЧислоВхождений(Строка, ПодстрокаПоиска) Цикл
		
		ё = Найти(Сред(Строка, ё + 1), ПодстрокаПоиска) + ё; 
		Ответ.Добавить(ё)
		
	КонецЦикла;
	
	Возврат Ответ
	
КонецФункции

Процедура РаспаковкаТекстаЗапроса() Экспорт
	
	РазмерШага = 536870912; // 2^29 секунд - это 17 лет назад - февраль 1997 года!
	
	ТекстЗапроса = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
	
	Разделители = СтрВхождения(ТекстЗапроса, ";");
	
	Рефрен = Сред(ТекстЗапроса, Разделители[1] + 1, Разделители[2] - Разделители[1]);
	
	Рефрены = "";
	
	Пока РазмерШага > 1 Цикл 
		
		Рефрены = Рефрены + СтрЗаменить(СтрЗаменить(Рефрен, "Шаг1", "Шаг" + Формат(РазмерШага / 2, "ЧГ=0")), "536870912", Формат(РазмерШага, "ЧГ=0")); 
		
		РазмерШага = РазмерШага / 2
		
	КонецЦикла;
	
	ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = Сред(ТекстЗапроса, 1, Разделители[1]) + Рефрены + Сред(ТекстЗапроса, Разделители[2] + 1)
	
КонецПроцедуры